---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TriangulationInterfaceForTriangulatedSolidOrShell Properties
TriangulationInterfaceForTriangulatedSolidOrShell Class See Also Send Feedback
---

The TriangulationInterfaceForTriangulatedSolidOrShell type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from TriangulationInterface.) |

# See Also

TriangulationInterfaceForTriangulatedSolidOrShell Class

Autodesk.Revit.DB Namespace